// import {formatTime} from "@/utils/formatTime";

const cardData = [
  {
    id: 1,
    type: 0, // 招标
    state: 0, // 活跃中
    title: '第三代等先进半导体产业标准化厂房建设项目（二期）',
    content:
      '无边框内容aaa填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容aaa填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容aaa填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容aaa填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容aaa填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容aaa填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容aaa填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容aaa填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容aaa填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容aaa填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充',
    startDate: new Date(2020, 5, 20, 12, 30, 0),
    endDate: new Date(2021, 7, 20, 12, 30, 0),
    tagIdList: [1, 2, 3, 4, 5, 7, 8],
    pageView: 111111111123,
  },
  {
    id: 2,
    type: 0, // 招标
    state: 0, // 活跃中
    title: '某部政治文化环境建设项目竞争性谈判公告',
    content:
      '无边框内容aaa填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充',
    startDate: new Date(2021, 5, 20, 12, 30, 0),
    endDate: new Date(2022, 7, 20, 12, 30, 0),
    tagIdList: [2, 6, 7],
    pageView: 123,
  },
  {
    id: 3,
    type: 1, // 中标
    state: 1, // 已结束
    title:
      '内邓高速渠首服务区培训中心周边环境建设一期工程施工及监理服务第1标段中标结果公告内邓高速渠首服务区培训中心周边环境建设一期工程施工及监理服务第1标段中标结果公告',
    content:
      '3无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充',
    startDate: new Date(2022, 5, 20, 12, 30, 0),
    endDate: new Date(2023, 7, 20, 12, 30, 0),
    tagIdList: [4, 5, 8],
    pageView: 112333333333,
  },
  {
    id: 4,
    type: 0, // 招标
    state: 0, // 活跃中
    title:
      '内邓高速渠首服务区培训中心周边环境建设一期工程施工及监理服务第1标段中标结果公告',
    content:
      '无边框内容4填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充',
    startDate: new Date(2024, 4, 20, 12, 30, 0),
    endDate: new Date(2025, 7, 20, 12, 30, 0),
    tagIdList: [1, 5, 7],
    pageView: 1123,
  },
  {
    id: 5,
    type: 0, // 招标
    state: 0, // 活跃中
    title: '第三代等先进半导体产业标准化厂房建设项目（二期）',
    content:
      '无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充',
    startDate: new Date(2022, 5, 20, 12, 30, 0),
    endDate: new Date(2024, 7, 20, 12, 30, 0),
    tagIdList: [2, 6, 7],
    pageView: 1123,
  },
  {
    id: 6,
    type: 1, // 中标
    state: 0, // 活跃中
    title:
      '6第三代标准化厂房项目第三代标准化厂房项目第三代标准化厂房项目第三代标准化厂房项目',
    content:
      '无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充',
    startDate: new Date(2021, 5, 20, 12, 30, 0),
    endDate: new Date(2022, 7, 20, 12, 30, 0),
    tagIdList: [1, 5, 8],
    pageView: 1123,
  },
  {
    id: 7,
    type: 0, // 招标
    state: 0, // 活跃中
    title:
      '7第三代标准化厂房项目第三代标准化厂房项目第三代标准化厂房项目第三代标准化厂房项目',
    content:
      '无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充',
    startDate: new Date(2021, 5, 20, 12, 30, 0),
    endDate: new Date(2022, 7, 20, 12, 30, 0),
    tagIdList: [1, 5, 7],
    pageView: 1123,
  },
  {
    id: 8,
    type: 0, // 招标
    state: 1, // 已结束
    title:
      '8第三代标准化厂房项目第三代标准化厂房项目第三代标准化厂房项目第三代标准化厂房项目',
    content:
      '无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充',
    startDate: new Date(2021, 5, 20, 12, 30, 0),
    endDate: new Date(2022, 7, 20, 12, 30, 0),
    tagIdList: [2, 6, 7],
    pageView: 1123,
  },
  {
    id: 9,
    type: 1, // 中标
    state: 0, // 活跃中
    title:
      '9第三代标准化厂房项目第三代标准化厂房项目第三代标准化厂房项目第三代标准化厂房项目',
    content:
      '无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充无边框内容填充',
    startDate: new Date(2021, 5, 20, 12, 30, 0),
    endDate: new Date(2022, 7, 20, 12, 30, 0),
    tagIdList: [4, 5, 8],
    pageView: 1123,
  },
];

export default cardData;
